testEdo/Labs/Lab04-HeatTransfer/combustor2D-RPF-highRe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

deltaT		5e-7;

stopAt          endTime;

endTime         0.2;

adjustTimeStep	yes;

maxCo		5;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#include	"functionObjects/integralValues"
	#include	"functionObjects/machNumber"
	fieldAverage1
{
    // Mandatory entries (unmodifiable)
    type            fieldAverage;
    libs            ("libfieldFunctionObjects.so");

    // Mandatory entries (runtime modifiable)
    fields
    (	
        U
        {
            mean     		true;
            prime2Mean  	true;
            base        	time;
	    windowType  	exact;
	    window       	0.05;
	    allowRestart 	true;
        }
        k
        {
            	mean        	true;
            	prime2Mean  	true;
            	base        	time;
            	windowType	exact;
            	window          0.05;
            	allowRestart    true;

       	}
	p
	{
		mean		true;
		prime2Mean	true;
		base		time;
            	windowType      exact;
            	window          0.05;
            	allowRestart    true;

	}
    	);

    	// Optional entries (runtime modifiable)
    	restartOnRestart    false;
    	restartOnOutput     false;
    	periodicRestart     false;
    	restartPeriod       0.002;

    	// Optional (inherited) entries
    	enabled         true;
    	log             false;
    	timeStart       0;
    	timeEnd         100;
    	writeControl    writeTime;
    	writeInterval   1;
 	}
}
