testEdo/Labs/Lab04-HeatTransfer/combustor2D-RPF-highRe/system/functionObjects/machNumber
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

MachNo1
{
    // Mandatory entries (unmodifiable)
    type            MachNo;
    libs            ("libfieldFunctionObjects.so");

    enabled         true;
    log             false;
    executeControl  writeTime;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   1;
}


// ************************************************************************* //
